{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "name": "input_1", "input_dtype": "float32", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"trainable": false, "name": "zeropadding2d_1", "padding": [3, 3]}, "name": "zeropadding2d_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 64, "name": "conv1", "border_mode": "valid", "nb_col": 7, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 7, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform"}, "name": "conv1", "inbound_nodes": [[["zeropadding2d_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn_conv1", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn_conv1", "inbound_nodes": [[["conv1", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_1", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["bn_conv1", 0, 0]]]}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "trainable": false, "pool_size": [3, 3], "dim_ordering": "tf"}, "name": "maxpooling2d_1", "inbound_nodes": [[["activation_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 64, "name": "res2a_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res2a_branch2a", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn2a_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn2a_branch2a", "inbound_nodes": [[["res2a_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_2", "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["bn2a_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 64, "name": "res2a_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res2a_branch2b", "inbound_nodes": [[["activation_2", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn2a_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn2a_branch2b", "inbound_nodes": [[["res2a_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_3", "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["bn2a_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res2a_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res2a_branch2c", "inbound_nodes": [[["activation_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res2a_branch1", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res2a_branch1", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn2a_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn2a_branch2c", "inbound_nodes": [[["res2a_branch2c", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn2a_branch1", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn2a_branch1", "inbound_nodes": [[["res2a_branch1", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_1", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_1", "inbound_nodes": [[["bn2a_branch2c", 0, 0], ["bn2a_branch1", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_4", "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 64, "name": "res2b_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res2b_branch2a", "inbound_nodes": [[["activation_4", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn2b_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn2b_branch2a", "inbound_nodes": [[["res2b_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_5", "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["bn2b_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 64, "name": "res2b_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res2b_branch2b", "inbound_nodes": [[["activation_5", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn2b_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn2b_branch2b", "inbound_nodes": [[["res2b_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_6", "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["bn2b_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res2b_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res2b_branch2c", "inbound_nodes": [[["activation_6", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn2b_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn2b_branch2c", "inbound_nodes": [[["res2b_branch2c", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_2", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_2", "inbound_nodes": [[["bn2b_branch2c", 0, 0], ["activation_4", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_7", "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["merge_2", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 64, "name": "res2c_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res2c_branch2a", "inbound_nodes": [[["activation_7", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn2c_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn2c_branch2a", "inbound_nodes": [[["res2c_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_8", "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["bn2c_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 64, "name": "res2c_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res2c_branch2b", "inbound_nodes": [[["activation_8", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn2c_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn2c_branch2b", "inbound_nodes": [[["res2c_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_9", "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["bn2c_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res2c_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res2c_branch2c", "inbound_nodes": [[["activation_9", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn2c_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn2c_branch2c", "inbound_nodes": [[["res2c_branch2c", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_3", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_3", "inbound_nodes": [[["bn2c_branch2c", 0, 0], ["activation_7", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_10", "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["merge_3", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 128, "name": "res3a_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform"}, "name": "res3a_branch2a", "inbound_nodes": [[["activation_10", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3a_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3a_branch2a", "inbound_nodes": [[["res3a_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_11", "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["bn3a_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 128, "name": "res3a_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3a_branch2b", "inbound_nodes": [[["activation_11", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3a_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3a_branch2b", "inbound_nodes": [[["res3a_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_12", "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["bn3a_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 512, "name": "res3a_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3a_branch2c", "inbound_nodes": [[["activation_12", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 512, "name": "res3a_branch1", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform"}, "name": "res3a_branch1", "inbound_nodes": [[["activation_10", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3a_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3a_branch2c", "inbound_nodes": [[["res3a_branch2c", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3a_branch1", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3a_branch1", "inbound_nodes": [[["res3a_branch1", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_4", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_4", "inbound_nodes": [[["bn3a_branch2c", 0, 0], ["bn3a_branch1", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_13", "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["merge_4", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 128, "name": "res3b_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3b_branch2a", "inbound_nodes": [[["activation_13", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3b_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3b_branch2a", "inbound_nodes": [[["res3b_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_14", "activation": "relu"}, "name": "activation_14", "inbound_nodes": [[["bn3b_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 128, "name": "res3b_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3b_branch2b", "inbound_nodes": [[["activation_14", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3b_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3b_branch2b", "inbound_nodes": [[["res3b_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_15", "activation": "relu"}, "name": "activation_15", "inbound_nodes": [[["bn3b_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 512, "name": "res3b_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3b_branch2c", "inbound_nodes": [[["activation_15", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3b_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3b_branch2c", "inbound_nodes": [[["res3b_branch2c", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_5", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_5", "inbound_nodes": [[["bn3b_branch2c", 0, 0], ["activation_13", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_16", "activation": "relu"}, "name": "activation_16", "inbound_nodes": [[["merge_5", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 128, "name": "res3c_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3c_branch2a", "inbound_nodes": [[["activation_16", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3c_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3c_branch2a", "inbound_nodes": [[["res3c_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_17", "activation": "relu"}, "name": "activation_17", "inbound_nodes": [[["bn3c_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 128, "name": "res3c_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3c_branch2b", "inbound_nodes": [[["activation_17", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3c_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3c_branch2b", "inbound_nodes": [[["res3c_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_18", "activation": "relu"}, "name": "activation_18", "inbound_nodes": [[["bn3c_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 512, "name": "res3c_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3c_branch2c", "inbound_nodes": [[["activation_18", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3c_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3c_branch2c", "inbound_nodes": [[["res3c_branch2c", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_6", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_6", "inbound_nodes": [[["bn3c_branch2c", 0, 0], ["activation_16", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_19", "activation": "relu"}, "name": "activation_19", "inbound_nodes": [[["merge_6", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 128, "name": "res3d_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3d_branch2a", "inbound_nodes": [[["activation_19", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3d_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3d_branch2a", "inbound_nodes": [[["res3d_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_20", "activation": "relu"}, "name": "activation_20", "inbound_nodes": [[["bn3d_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 128, "name": "res3d_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3d_branch2b", "inbound_nodes": [[["activation_20", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3d_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3d_branch2b", "inbound_nodes": [[["res3d_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_21", "activation": "relu"}, "name": "activation_21", "inbound_nodes": [[["bn3d_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 512, "name": "res3d_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res3d_branch2c", "inbound_nodes": [[["activation_21", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn3d_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn3d_branch2c", "inbound_nodes": [[["res3d_branch2c", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_7", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_7", "inbound_nodes": [[["bn3d_branch2c", 0, 0], ["activation_19", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_22", "activation": "relu"}, "name": "activation_22", "inbound_nodes": [[["merge_7", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4a_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform"}, "name": "res4a_branch2a", "inbound_nodes": [[["activation_22", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4a_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4a_branch2a", "inbound_nodes": [[["res4a_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_23", "activation": "relu"}, "name": "activation_23", "inbound_nodes": [[["bn4a_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4a_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4a_branch2b", "inbound_nodes": [[["activation_23", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4a_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4a_branch2b", "inbound_nodes": [[["res4a_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_24", "activation": "relu"}, "name": "activation_24", "inbound_nodes": [[["bn4a_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 1024, "name": "res4a_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4a_branch2c", "inbound_nodes": [[["activation_24", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 1024, "name": "res4a_branch1", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform"}, "name": "res4a_branch1", "inbound_nodes": [[["activation_22", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4a_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4a_branch2c", "inbound_nodes": [[["res4a_branch2c", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4a_branch1", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4a_branch1", "inbound_nodes": [[["res4a_branch1", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_8", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_8", "inbound_nodes": [[["bn4a_branch2c", 0, 0], ["bn4a_branch1", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_25", "activation": "relu"}, "name": "activation_25", "inbound_nodes": [[["merge_8", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4b_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4b_branch2a", "inbound_nodes": [[["activation_25", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4b_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4b_branch2a", "inbound_nodes": [[["res4b_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_26", "activation": "relu"}, "name": "activation_26", "inbound_nodes": [[["bn4b_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4b_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4b_branch2b", "inbound_nodes": [[["activation_26", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4b_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4b_branch2b", "inbound_nodes": [[["res4b_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_27", "activation": "relu"}, "name": "activation_27", "inbound_nodes": [[["bn4b_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 1024, "name": "res4b_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4b_branch2c", "inbound_nodes": [[["activation_27", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4b_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4b_branch2c", "inbound_nodes": [[["res4b_branch2c", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_9", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_9", "inbound_nodes": [[["bn4b_branch2c", 0, 0], ["activation_25", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_28", "activation": "relu"}, "name": "activation_28", "inbound_nodes": [[["merge_9", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4c_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4c_branch2a", "inbound_nodes": [[["activation_28", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4c_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4c_branch2a", "inbound_nodes": [[["res4c_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_29", "activation": "relu"}, "name": "activation_29", "inbound_nodes": [[["bn4c_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4c_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4c_branch2b", "inbound_nodes": [[["activation_29", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4c_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4c_branch2b", "inbound_nodes": [[["res4c_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_30", "activation": "relu"}, "name": "activation_30", "inbound_nodes": [[["bn4c_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 1024, "name": "res4c_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4c_branch2c", "inbound_nodes": [[["activation_30", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4c_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4c_branch2c", "inbound_nodes": [[["res4c_branch2c", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_10", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_10", "inbound_nodes": [[["bn4c_branch2c", 0, 0], ["activation_28", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_31", "activation": "relu"}, "name": "activation_31", "inbound_nodes": [[["merge_10", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4d_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4d_branch2a", "inbound_nodes": [[["activation_31", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4d_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4d_branch2a", "inbound_nodes": [[["res4d_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_32", "activation": "relu"}, "name": "activation_32", "inbound_nodes": [[["bn4d_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4d_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4d_branch2b", "inbound_nodes": [[["activation_32", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4d_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4d_branch2b", "inbound_nodes": [[["res4d_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_33", "activation": "relu"}, "name": "activation_33", "inbound_nodes": [[["bn4d_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 1024, "name": "res4d_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4d_branch2c", "inbound_nodes": [[["activation_33", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4d_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4d_branch2c", "inbound_nodes": [[["res4d_branch2c", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_11", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_11", "inbound_nodes": [[["bn4d_branch2c", 0, 0], ["activation_31", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_34", "activation": "relu"}, "name": "activation_34", "inbound_nodes": [[["merge_11", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4e_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4e_branch2a", "inbound_nodes": [[["activation_34", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4e_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4e_branch2a", "inbound_nodes": [[["res4e_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_35", "activation": "relu"}, "name": "activation_35", "inbound_nodes": [[["bn4e_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4e_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4e_branch2b", "inbound_nodes": [[["activation_35", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4e_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4e_branch2b", "inbound_nodes": [[["res4e_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_36", "activation": "relu"}, "name": "activation_36", "inbound_nodes": [[["bn4e_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 1024, "name": "res4e_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4e_branch2c", "inbound_nodes": [[["activation_36", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4e_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4e_branch2c", "inbound_nodes": [[["res4e_branch2c", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_12", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_12", "inbound_nodes": [[["bn4e_branch2c", 0, 0], ["activation_34", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_37", "activation": "relu"}, "name": "activation_37", "inbound_nodes": [[["merge_12", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4f_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4f_branch2a", "inbound_nodes": [[["activation_37", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4f_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4f_branch2a", "inbound_nodes": [[["res4f_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_38", "activation": "relu"}, "name": "activation_38", "inbound_nodes": [[["bn4f_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 256, "name": "res4f_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4f_branch2b", "inbound_nodes": [[["activation_38", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4f_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4f_branch2b", "inbound_nodes": [[["res4f_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_39", "activation": "relu"}, "name": "activation_39", "inbound_nodes": [[["bn4f_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 1024, "name": "res4f_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res4f_branch2c", "inbound_nodes": [[["activation_39", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn4f_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn4f_branch2c", "inbound_nodes": [[["res4f_branch2c", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_13", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_13", "inbound_nodes": [[["bn4f_branch2c", 0, 0], ["activation_37", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_40", "activation": "relu"}, "name": "activation_40", "inbound_nodes": [[["merge_13", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 512, "name": "res5a_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform"}, "name": "res5a_branch2a", "inbound_nodes": [[["activation_40", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn5a_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn5a_branch2a", "inbound_nodes": [[["res5a_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_41", "activation": "relu"}, "name": "activation_41", "inbound_nodes": [[["bn5a_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 512, "name": "res5a_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res5a_branch2b", "inbound_nodes": [[["activation_41", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn5a_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn5a_branch2b", "inbound_nodes": [[["res5a_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_42", "activation": "relu"}, "name": "activation_42", "inbound_nodes": [[["bn5a_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 2048, "name": "res5a_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res5a_branch2c", "inbound_nodes": [[["activation_42", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 2048, "name": "res5a_branch1", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [2, 2], "init": "glorot_uniform"}, "name": "res5a_branch1", "inbound_nodes": [[["activation_40", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn5a_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn5a_branch2c", "inbound_nodes": [[["res5a_branch2c", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn5a_branch1", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn5a_branch1", "inbound_nodes": [[["res5a_branch1", 0, 0]]]}, {"class_name": "Merge", "config": {"mode": "sum", "concat_axis": -1, "name": "merge_14", "arguments": {}, "mode_type": "raw", "output_shape": null, "output_mask": null, "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw"}, "name": "merge_14", "inbound_nodes": [[["bn5a_branch2c", 0, 0], ["bn5a_branch1", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_43", "activation": "relu"}, "name": "activation_43", "inbound_nodes": [[["merge_14", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 512, "name": "res5b_branch2a", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res5b_branch2a", "inbound_nodes": [[["activation_43", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn5b_branch2a", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn5b_branch2a", "inbound_nodes": [[["res5b_branch2a", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_44", "activation": "relu"}, "name": "activation_44", "inbound_nodes": [[["bn5b_branch2a", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 512, "name": "res5b_branch2b", "border_mode": "same", "nb_col": 3, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 3, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res5b_branch2b", "inbound_nodes": [[["activation_44", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn5b_branch2b", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, "momentum": 0.99, "beta_regularizer": null}, "name": "bn5b_branch2b", "inbound_nodes": [[["res5b_branch2b", 0, 0]]]}, {"class_name": "Activation", "config": {"trainable": false, "name": "activation_45", "activation": "relu"}, "name": "activation_45", "inbound_nodes": [[["bn5b_branch2b", 0, 0]]]}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 2048, "name": "res5b_branch2c", "border_mode": "valid", "nb_col": 1, "b_constraint": null, "trainable": false, "b_regularizer": null, "activation": "linear", "W_constraint": null, "activity_regularizer": null, "bias": true, "nb_row": 1, "dim_ordering": "tf", "subsample": [1, 1], "init": "glorot_uniform"}, "name": "res5b_branch2c", "inbound_nodes": [[["activation_45", 0, 0]]]}, {"class_name": "BatchNormalization", "config": {"mode": 0, "axis": 3, "name": "bn5b_branch2c", "epsilon": 0.001, "gamma_regularizer": null, "trainable": false, 